using System;
using System.Collections.Generic;
using System.Linq;
using System.Text;
using System.Threading.Tasks;

namespace LR1
{
    class Program
    {
        static void Main(string[] args)
        {
            Console.WriteLine("Когда жених, невеста и провожатые подошли к \"Резерву\", г-н Мор-" +
                "\nрель пошёл к ним навстречу, окружённый матросами и солдатами, " +
                "\nкоторым он повторил обещание, данное Дантесу, что он будет " +
                "\nназначен капитаном на место покойного Леклера. Увидев его, Дан-" +
                "\nтес выпустил руку Мерседес и уступил место г-ну Моррелю. Арма-" +
                "\nтор и невеста, подавая пример гостям, взошли по лестнице в столо-" +
                "\nвую, и ещё добрых пять минут деревянные ступени скрипели под " +
                "\nтяжёлыми шагами гостей.");
            Console.ReadLine();
        }
    }
}
